# HomeCamera Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HomeCamera Constructor
HomeCamera Class See Also
---
Constructs a new copy of the input HomeCamera object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public HomeCamera(
	HomeCamera other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As HomeCamera _
)
```

Visual C++
---
```text
public:
HomeCamera(
	HomeCamera^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..HomeCamera
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
HomeCamera Class
Autodesk.Revit.DB Namespace